B5.1.2.1 Задание
1 point possible (graded)
Давайте попробуем загрузить "log.csv" в dataframe log с помощью read_csv. Для начала не передавайте никаких дополнительных параметров!

В результате переменная log должна содержать загруженный из файла датафрейм

In [2]:
import pandas as pd
log=pd.read_csv('log.csv' )
#users=pd.read_csv('users.csv')

In [3]:
display(log.info())
#display(users.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 4 columns):
Запись пользователя № - user_919    999 non-null object
[2019-01-01 14:06:51                984 non-null object
Unnamed: 2                          485 non-null float64
Unnamed: 3                          138 non-null float64
dtypes: float64(2), object(2)
memory usage: 31.3+ KB

None

NameError: name 'users' is not defined

In [23]:
log=pd.read_csv('log.csv',header = None)

In [24]:
display(log.head())

                                  0                     1   2   3
0  Запись пользователя № - user_919  [2019-01-01 14:06:51 NaN NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16 NaN NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16 NaN NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51 NaN NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18 NaN NaN

In [30]:
sample=pd.read_csv('sample.csv') 
sample.columns=['name','city','age','profession']

In [34]:
display(sample.head())

      name         city  age profession
0   Иванов       Москва   25     Клинер
1      NaN    Волгоград   31   Менеджер
2   Иванов       Москва   25     Клинер
3  sidorov  Владивосток   43   Менеджер
4  _______        Курск   50   Водитель

In [35]:
log.columns=['user_id','time','bet','win']
display(log.head())

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18  NaN  NaN

B5.2.4.1 Задание
1 point possible (graded)
Загрузите файл users.csv в переменную users. Будьте осторожны :)
Не открывается сразу? Попробуйте открыть этот файл в текстовом редакторе и разобраться, что с ним не так!
Посмотрите какие параметры есть у функции read_csv? В чем может быть ошибка?
С помощью правильных параметров read_csv загрузите датафрейм

In [77]:
users=pd.read_csv('users.csv', sep='\t', encoding='KOI8-R')

In [78]:
display(users.head())

     Юзверь                 мейл        Гео
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

Продолжаем работать с users.csv. Прочитайте еще раз файл в переменную users. Замените в нем названия колонок на

user_id
email
geo

In [73]:
users=pd.read_csv('users.csv', sep='\t', skiprows=1,header = None, encoding='KOI8-R')
users.columns=['user_id','email','geo']
display(users.head())

    user_id                email        geo
0  User_943  Accumanst@gmail.com     Ижевск
1  User_908    Advismowr@mail.ru     Ижевск
2  User_962      Anachso@ukr.net  Краснодар
3  User_973     Antecia@inbox.ru      Пермь
4  User_902   Balliaryva@ukr.net        NaN

In [79]:
sample.name.unique()

array(['Иванов', nan, 'sidorov', '_______', 'Кузнецов', 'Сажин',
       'Котлеревский', 'Завалишина', 'Левина', 'Фикс'], dtype=object)

In [80]:
display(users.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
Юзверь    100 non-null object
мейл      99 non-null object
Гео       97 non-null object
dtypes: object(3)
memory usage: 2.5+ KB

None

In [81]:
log.user_id.unique()

array(['Запись пользователя № - user_919',
       'Запись пользователя № - user_973',
       'Запись пользователя № - user_903',
       'Запись пользователя № - user_954',
       'Запись пользователя № - user_917',
       'Запись пользователя № - user_900',
       'Запись пользователя № - user_980',
       'Запись пользователя № - user_906',
       'Запись пользователя № - user_952',
       'Запись пользователя № - user_972',
       'Запись пользователя № - user_966',
       'Запись пользователя № - user_964',
       'Запись пользователя № - user_978',
       'Запись пользователя № - user_968',
       'Запись пользователя № - user_974',
       'Запись пользователя № - user_998',
       'Запись пользователя № - user_990',
       'Запись пользователя № - user_942',
       'Запись пользователя № - user_929',
       'Запись пользователя № - user_976',
       'Запись пользователя № - user_927',
       'Запись пользователя № - user_951',
       'Запись пользователя № - user_949',
       'Запись пользователя № - user_987',
       'Запись пользователя № - user_985',
       'Запись пользователя № - user_992',
       'Запись пользователя № - user_937',
       'Запись пользователя № - user_913',
       'Запись пользователя № - user_948',
       'Запись пользователя № - user_916',
       'Запись пользователя № - user_938',
       'Запись пользователя № - user_997',
       'Запись пользователя № - user_940',
       'Запись пользователя № - user_918',
       'Запись пользователя № - user_960',
       'Запись пользователя № - user_905',
       'Запись пользователя № - user_924',
       'Запись пользователя № - user_958',
       'Запись пользователя № - user_920',
       'Запись пользователя № - user_943',
       'Запись пользователя № - user_935',
       'Запись пользователя № - user_915',
       'Запись пользователя № - user_921',
       'Запись пользователя № - user_999',
       'Запись пользователя № - user_982',
       'Запись пользователя № - user_928',
       'Запись пользователя № - user_944',
       'Запись пользователя № - user_912',
       'Запись пользователя № - user_969',
       'Запись пользователя № - user_901',
       'Запись пользователя № - user_995',
       'Запись пользователя № - user_933',
       'Запись пользователя № - user_986',
       'Запись пользователя № - user_971',
       'Запись пользователя № - user_977',
       'Запись пользователя № - user_979',
       'Запись пользователя № - user_910',
       'Запись пользователя № - user_994',
       'Запись пользователя № - user_907',
       'Запись пользователя № - user_941',
       'Запись пользователя № - user_989',
       'Запись пользователя № - user_955',
       'Запись пользователя № - user_991',
       'Запись пользователя № - user_996',
       'Запись пользователя № - user_926',
       'Запись пользователя № - user_984',
       'Запись пользователя № - user_957',
       'Запись пользователя № - user_914',
       'Запись пользователя № - user_988',
       'Запись пользователя № - user_923',
       'Запись пользователя № - user_967',
       'Запись пользователя № - user_945',
       'Запись пользователя № - user_993',
       'Запись пользователя № - user_908',
       'Запись пользователя № - user_930',
       'Запись пользователя № - user_981',
       'Запись пользователя № - user_936',
       'Запись пользователя № - user_922',
       'Запись пользователя № - user_962',
       'Запись пользователя № - user_965',
       'Запись пользователя № - user_959',
       'Запись пользователя № - user_963',
       'Запись пользователя № - user_904',
       'Запись пользователя № - user_931',
       'Запись пользователя № - user_1000',
       'Запись пользователя № - user_946',
       'Запись пользователя № - user_970',
       'Запись пользователя № - user_939',
       'Запись пользователя № - user_961',
       'Запись пользователя № - user_911',
       'Запись пользователя № - user_950',
       'Запись пользователя № - user_956',
       'Запись пользователя № - user_909',
       'Запись пользователя № - user_983',
       'Запись пользователя № - user_902',
       'Запись пользователя № - user_947',
       'Запись пользователя № - user_975',
       'Запись пользователя № - user_953',
       'Запись пользователя № - user_925',
       'Запись пользователя № - user_934',
       'Запись пользователя № - user_932', '#error'], dtype=object)

B5.3.2.1 Задание
1 point possible (graded)
Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет

In [83]:
sample2=sample[sample.age<30]
display(sample2.head())

       name    city  age profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

B5.3.2.2 Задание
1 point possible (graded)
Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [85]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log_win=log[log.win>0]
win_count=len(log_win)
display(win_count)

138

B5.3.2.3 Задание
1 point possible (graded)
Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [88]:
sample = pd.read_csv("sample.csv")
sample2 = sample[(sample.Profession=='Рабочий')&(sample.Age<30)]
display(sample.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
Name          10 non-null object
City          10 non-null object
Age           11 non-null int64
Profession    11 non-null object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

None

B5.3.3.1 Задание
1 point possible (graded)
С помощью функции query найдите тех, у кого ставка меньше 2000, а выигрыш больше 0. Сохраните в новый датафрейм log2.

In [92]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log2=log.query('bet<2000&win>0')
display(log2.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 113 entries, 151 to 991
Data columns (total 4 columns):
user_id    113 non-null object
time       112 non-null object
bet        113 non-null float64
win        113 non-null float64
dtypes: float64(2), object(2)
memory usage: 4.4+ KB

None

B5.3.4.1 Задание
1 point possible (graded)
Найдите записи, где в городах есть буква «о», и сохраните в переменную sample3.
Функция contains не может работать с пустыми значениями: необходимо использовать параметр na = False

In [94]:
sample = pd.read_csv("sample.csv")
sample3=sample[sample.City.str.contains("о", na=False)]
display(sample3)

           Name         City  Age Profession
0        Иванов       Москва   25     Клинер
1           NaN    Волгоград   31   Менеджер
2        Иванов       Москва   25     Клинер
3       sidorov  Владивосток   43   Менеджер
5      Кузнецов         Сочи   19    Рабочий
7  Котлеревский   Йошкар-Ола   32    Рабочий
8    Завалишина    Чебоксары   36   Менеджер

In [ ]:
B5.3.4.2 Задание
1 point possible (graded)
Найдите записи, где в городах нет буквы "о", и сохраните в переменную sample4. Не забудьте про NaN и параметр na:

In [97]:
sample4=sample[~sample.City.str.contains("о","NaN",na=False)]
display(sample4)

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

B5.3.4.3 Задание
1 point possible (graded)
Сохраните в переменную new_log датафрейм, из которого удалены записи, в которых есть ошибка в поле user_id

In [99]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
# Напишите ваш код ниже
new_log=log[~log.user_id.str.contains("#error",na=False)]
display(new_log)

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

B5.3.5.1 Задание
1 point possible (graded)
С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2. В переменной sample2 должен содержаться весь датафрейм sample.

In [130]:
sample = pd.read_csv("sample.csv")
# Напишите ваш код ниже
sample['Age'] = sample.Age.apply(lambda x: x + 1)
sample2 = sample
display(sample2)

            Name         City  Age Profession
0         Иванов       Москва   26     Клинер
1            NaN    Волгоград   32   Менеджер
2         Иванов       Москва   26     Клинер
3        sidorov  Владивосток   44   Менеджер
4        _______        Курск   51   Водитель
5       Кузнецов         Сочи   20    Рабочий
6          Сажин       Сургут   30    Рабочий
7   Котлеревский   Йошкар-Ола   33    Рабочий
8     Завалишина    Чебоксары   37   Менеджер
9         Левина          NaN   56    Рабочий
10          Фикс         Рига   43    Рабочий

B5.3.5.2 Задание
1 point possible (graded)
С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2.
Вам может понадобится функция s.lower()
Обратите внимание - что, когда в столбце есть пропущенные значения, необходимо в явном виде указывать, что это str

    str(s).lower()

In [131]:
sample = pd.read_csv("sample.csv")
#  Допишите ваш код ниже
sample['City'] = sample.City.apply(lambda x:str(x).lower())
sample2 = sample
display(sample2)

            Name         City  Age Profession
0         Иванов       москва   25     Клинер
1            NaN    волгоград   31   Менеджер
2         Иванов       москва   25     Клинер
3        sidorov  владивосток   43   Менеджер
4        _______        курск   50   Водитель
5       Кузнецов         сочи   19    Рабочий
6          Сажин       сургут   29    Рабочий
7   Котлеревский   йошкар-ола   32    Рабочий
8     Завалишина    чебоксары   36   Менеджер
9         Левина          nan   55    Рабочий
10          Фикс         рига   42    Рабочий

1 point possible (graded)
Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает

0 - если на вход поступила строка "Рабочий"
1 - если на вход поступила строка "Менеджер"
2 - в любом другом случае

In [ ]:
def profession_code(x):
    if x=='Рабочий':
        return 0
    elif x=='Менеджер':
        return 1
    else:
        return 2

B5.3.5.4 Задание
1 point possible (graded)
Примените написанную вами функцию profession_code для того, чтобы заменить поле Profession с помощью apply. Сохраните получившийся датафрейм в переменную sample2.

Функцию необходимо определить повторно!

In [135]:
sample = pd.read_csv("sample.csv")
#  Напишите ваш код ниже
def profession_code(x):
    if x=='Рабочий':
        return 0
    elif x=='Менеджер':
        return 1
    else:
        return 2
sample['Profession'] = sample.Profession.apply(profession_code)
sample2 = sample
display(sample2)

            Name         City  Age  Profession
0         Иванов       Москва   25           2
1            NaN    Волгоград   31           1
2         Иванов       Москва   25           2
3        sidorov  Владивосток   43           1
4        _______        Курск   50           2
5       Кузнецов         Сочи   19           0
6          Сажин       Сургут   29           0
7   Котлеревский   Йошкар-Ола   32           0
8     Завалишина    Чебоксары   36           1
9         Левина          NaN   55           0
10          Фикс         Рига   42           0

B5.3.5.5 Задание
1 point possible (graded)
Напишите функцию age_category, которая на вход получает число, а на выход отдает

"молодой" - если возраст меньше 23
"средний" - если возраст от 23 до 35
"зрелый" - если возраст больше 35

In [ ]:
def age_category(age):
    if age<23:
        return 'молодой'
    elif age>23  and age<35:
        return 'средний'
    else:
        return 'хрелый'
# Ваш код ниже

B5.3.5.6 Задание
1 point possible (graded)
Примените функцию age_category и apply, чтобы создать новую колонку в sample под названием 'Age_category'. Не забудьте загрузить датафрейм!

Напоминаем как создать новую колонку
df['new_column'] = df.old_column.apply(func)

In [137]:
sample = pd.read_csv("sample.csv")
#  Напишите ваш код ниже
def age_category(age):
    if age<23:
        return 'молодой'
    elif age>23  and age<35:
        return 'средний'
    else:
        return 'зрелый'
sample['Age_category'] = sample.Age.apply(age_category)
display(sample)

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя. Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974".

На месте записей с ошибками в user_id должна быть пустая строка "". Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

In [5]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
def user_change(x):
    if x=='#error':
        return ''
    else:
        return x[24:]
# Напишите ваш код ниже
log['user_id'] = log.user_id.apply(user_change)
display(log)

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]

B5.3.5.8 Задание
1 point possible (graded)
Загрузите log.csv в log. Удалите квадратную скобку из первой строки в столбце time, чтобы привести его к более привычному формату: t равен log.time[0]. Сохраните результат в t:

In [26]:
log = pd.read_csv("log.csv",header=None) 
log.columns = ['user_id','time','bet','win']
log['time'] = log['time'].str.replace('[','')
display(log)
# Удалите квадратную скобку из t, чтобы привести его к более привычному формату

                              user_id                 time      bet      win
0    Запись пользователя № - user_919  2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  2019-01-01 21:31:18      NaN      NaN
..                                ...                  ...      ...      ...
995  Запись пользователя № - user_984   2019-04-20 9:59:58   9754.0      NaN
996                            #error                  NaN  10054.0  29265.0
997                            #error                  NaN  10454.0      NaN
998                            #error                  NaN   1000.0      NaN
999                            #error                  NaN  10754.0      NaN

[1000 rows x 4 columns]

Соединим всё, что мы делали, и очистим файл log.csv. А именно:
прочитаем файл в переменную log;
добавим названия колонок user_id, time, bet, win;
удалим строки, которые содержат значения user_id с ошибками;
оставим в user_id только значения идентификатора;
уберём начальную скобку из поля time.

In [30]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time','bet','win']
def user_id_check(x):
        if x=='#error':
            return ''
        else:
            return x[24:]
log['user_id']=log.user_id.apply(user_id_check)
log=log[~log.user_id.str.contains("#error",na=False)]
log['time'] = log.time.str.replace('[','')
display(log)

      user_id                 time      bet      win
0    user_919  2019-01-01 14:06:51      NaN      NaN
1    user_973  2019-01-01 14:51:16      NaN      NaN
2    user_903  2019-01-01 16:31:16      NaN      NaN
3    user_954  2019-01-01 17:17:51      NaN      NaN
4    user_954  2019-01-01 21:31:18      NaN      NaN
..        ...                  ...      ...      ...
995  user_984   2019-04-20 9:59:58   9754.0      NaN
996                            NaN  10054.0  29265.0
997                            NaN  10454.0      NaN
998                            NaN   1000.0      NaN
999                            NaN  10754.0      NaN

[1000 rows x 4 columns]